<!-- add-pr-comment:quicksight_plan -->

# staging/quicksight Terragrunt Plan:
```shell
Terraform will perform the following actions:
  # aws_iam_policy.datalake-reader-s3 will be created
  + resource "aws_iam_policy" "datalake-reader-s3" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allow access to S3 in the datalake account"
      + id               = (known after apply)
      + name             = "s3-access-cross-account"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::cds-data-lake-raw-production",
                          + "arn:aws:s3:::cds-data-lake-raw-production/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }
  # aws_iam_role.datalake-reader will be created
  + resource "aws_iam_role" "datalake-reader" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "glue.amazonaws.com",
                              + "athena.amazonaws.com",
                            ]
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "datalake-reader-cross-account-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
      + inline_policy (known after apply)
    }
  # aws_iam_role_policy_attachment.datalake-reader-s3-attach will be created
  + resource "aws_iam_role_policy_attachment" "datalake-reader-s3-attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "datalake-reader-cross-account-role"
    }
Plan: 3 to add, 0 to change, 0 to destroy.

# --- End of Plan 1 ---